In [2]:
import pandas as pd
import  numpy as np
pop={'Nevada':{2001:2.4,2002: 3.6},
    'Ohio':{2000: 1.5,2001:1.7,2002: 3.4}}

In [3]:
pop=pd.DataFrame(pop)

In [4]:
pop

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     3.6   3.4

In [5]:
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     3.6   3.4
2003     NaN   NaN

In [6]:
pdata = {'Ohio': pop['Ohio'][:-1],
         'Nevada': pop['Nevada'][:2]}

In [7]:
pdata

{'Ohio': 2000    1.5
 2001    1.7
 Name: Ohio, dtype: float64, 'Nevada': 2000    NaN
 2001    2.4
 Name: Nevada, dtype: float64}

In [8]:
pop

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     3.6   3.4

In [9]:
a=pop['Ohio'][:-1]

In [10]:
b=pop['Nevada'][:2]

In [11]:
pdata = {'Ohio': a,'Nevada':b}

In [12]:
pdata = pd.DataFrame(pop)

In [13]:
pdata

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     3.6   3.4

In [14]:
pop.index.name ='year' ; pop.columns.name='state'

In [15]:
pop

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      3.6   3.4

In [16]:
pop.values

array([[nan, 1.5],
       [2.4, 1.7],
       [3.6, 3.4]])

# index objects

In [17]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])

In [18]:
index = obj.index

In [19]:
index[1:]

Index(['b', 'c'], dtype='object')

In [20]:
obj[1:]

b    1
c    2
dtype: int64

In [21]:
labels = pd.Index(np.arange(3))

In [22]:
labels

Int64Index([0, 1, 2], dtype='int64')

# Reindexing

In [23]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [24]:
obj2 = obj.reindex(['a','b','c','d','e'])

In [25]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [26]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [27]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [28]:
obj3.reindex(range(6), method = 'ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [29]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
index=['a', 'c', 'd'],
columns=['Ohio', 'Texas', 'California'])

In [30]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [31]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [32]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [33]:
states = ['Texas', 'Utah', 'California']

In [34]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [35]:
 frame.loc[['a', 'b', 'c', 'd'], states]

F:\anaconda\lib\site-packages\pandas\core\indexing.py:1494: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [36]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])

In [37]:
new_obj = obj.drop('c')

In [38]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [39]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [40]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [41]:
obj.drop(['d','c'], inplace=True)

In [42]:
obj

a    0.0
b    1.0
e    4.0
dtype: float64

In [43]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [44]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [45]:
 data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [46]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [47]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

# Indexing, Selection, and Filtering

In [48]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [49]:
obj['b']

1.0

In [50]:
obj['b':'d']

b    1.0
c    2.0
d    3.0
dtype: float64

In [51]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [52]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [53]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [54]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [55]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [56]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [57]:
 data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [58]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)),
                   columns=list('bcd'),
                   index=['Ohio', 'Texas', 'Colorado'])

In [59]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [60]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [61]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [62]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [63]:
df1 = pd.DataFrame({'A': [1, 2]})

In [64]:
df2 = pd.DataFrame({'B': [3, 4]})

In [65]:
df1

   A
0  1
1  2

In [66]:
df2

   B
0  3
1  4

In [67]:
df1-df2

    A   B
0 NaN NaN
1 NaN NaN

# Arithmetic methods with fill values

In [68]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list('abcd'))

In [69]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [70]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list('abcde'))

In [71]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [72]:
df2.loc[1, 'b'] = np.nan

In [73]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [74]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [75]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

# operations between DataFrame and Series

# Function Application and Mapping

In [76]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [77]:
frame

               b         d         e
Utah    0.440351 -0.489339 -1.735282
Ohio   -0.647926 -0.026220 -0.913559
Texas   0.399329  1.863041  0.155644
Oregon  0.905592  0.298273  0.476344

# lambda function

In [78]:
f = lambda x: x*100
f(2)

200

In [79]:
f = lambda x: x.max() - x.min()
frame.apply(f)

b    1.553518
d    2.352380
e    2.211626
dtype: float64

In [80]:
frame.apply(f, axis='columns')

Utah      2.175632
Ohio      0.887339
Texas     1.707397
Oregon    0.607320
dtype: float64

In [81]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])

In [82]:
#similar work which we done in lambda
frame.apply(f)

            b         d         e
min -0.647926 -0.489339 -1.735282
max  0.905592  1.863041  0.476344

# Sorting and Ranking

In [91]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [85]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [86]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])

In [87]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [88]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [97]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [98]:
obj.sort_values()

d    0
a    1
b    2
c    3
dtype: int64

In [99]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [100]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [101]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1